# Concatenating Tables with Set-Like Operations in `pyspark`

Now let's look at combining tables with `union`, `intersect`, and `except` in `pyspark`.

In [153]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName('Ops').config('spark.driver.host', 'localhost').getOrCreate()

## Example - Auto Sales in Spark

In [154]:
from more_pyspark import to_pandas
sales_aprk = spark.read.csv("./data/auto_sales_apr.csv",  header=True, inferSchema=True)
sales_aprk.collect() >> to_pandas

  Salesperson  Compact  Sedan  SUV  Truck
0         Ann       22     18   15     12
1         Bob       20     14    6     24
2     Yolanda       19     10   28     17
3      Xerxes       11     27   17      9

In [155]:
sales_mayk = spark.read.csv("./data/auto_sales_may.csv",  header=True, inferSchema=True)
sales_mayk.collect() >> to_pandas

  Salesperson  Compact  Sedan  SUV  Truck
0         Ann       22     18   15     12
1         Bob       19     12   17     20
2     Yolanda       19      8   32     15
3      Xerxes       12     23   18      9

## `UNION ALL` in `pyspark`

Both `union` and `unionAll` area actually `UNION ALL`

In [156]:
(sales_aprk
 .union(sales_mayk)
 .collect()
) >> to_pandas

  Salesperson  Compact  Sedan  SUV  Truck
0         Ann       22     18   15     12
1         Bob       20     14    6     24
2     Yolanda       19     10   28     17
3      Xerxes       11     27   17      9
4         Ann       22     18   15     12
5         Bob       19     12   17     20
6     Yolanda       19      8   32     15
7      Xerxes       12     23   18      9

## `UNION/UNION DISTINCT` in `pyspark`

Use `distinct` to get the usual `UNION/UNION DISTINCT`

In [158]:
(sales_aprk
 .union(sales_mayk)
 .distinct()
 .collect()
) >> to_pandas

  Salesperson  Compact  Sedan  SUV  Truck
0      Xerxes       12     23   18      9
1         Bob       20     14    6     24
2     Yolanda       19      8   32     15
3         Ann       22     18   15     12
4         Bob       19     12   17     20
5     Yolanda       19     10   28     17
6      Xerxes       11     27   17      9

## Adding a `month` column

As mentioned before, we really should add a month column here. Note that we need to use `lit` to add a *literal constant*

In [160]:
from pyspark.sql.functions import lit

(sales_aprk.withColumn('month', lit('April'))
 .union(sales_mayk.withColumn('month', lit('May')))
 .collect()
) >> to_pandas

  Salesperson  Compact  Sedan  SUV  Truck  month
0         Ann       22     18   15     12  April
1         Bob       20     14    6     24  April
2     Yolanda       19     10   28     17  April
3      Xerxes       11     27   17      9  April
4         Ann       22     18   15     12    May
5         Bob       19     12   17     20    May
6     Yolanda       19      8   32     15    May
7      Xerxes       12     23   18      9    May

## Performing `INTERSECT`

Note that `intersect` and `intersectAll` are synonymous.

In [161]:
sales_aprk.intersect(sales_mayk).collect() >> to_pandas

  Salesperson  Compact  Sedan  SUV  Truck
0         Ann       22     18   15     12

## Performing a set difference with `exceptAll`

In [162]:
sales_aprk.exceptAll(sales_mayk).collect() >> to_pandas

  Salesperson  Compact  Sedan  SUV  Truck
0     Yolanda       19     10   28     17
1      Xerxes       11     27   17      9
2         Bob       20     14    6     24

## <font color="red"> Exercise 2 </font>

In the data folder, you will find 6 files that contain a sample 100,000 rows from the uber data for the month apr14-sep14.  Perform the following tasks:

1. Use `glob` to get all 6 file paths.
2. Use a regular expression to create a `lambda` function that pulls the month from the files.
3. Read the 6 `pyspark` dataframes into a `dict` with keys equal to the month name and values containing the corresponding data frame.
4. Use a dictionary comprehension to add a month column to each `df`.
5. Use the accumulator pattern and the `union` method to combine these 6 data frames into one combined `pysaprk df`
6. Inspect the head and compute the number of rows (use the `count` method)

In [95]:
# Your code here

## Up Next

Stuff